app/controllers/holidays_controller.rb

SELECT "holidays".* FROM "holidays"
---
  def index
    @holidays = Holiday.all

INSERT INTO "holidays" ("name", "holiday_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Diwali"], ["holiday_date", Sun, 30 Oct 2016], ["created_at", 2016-11-21 10:39:16 UTC], ["updated_at", 2016-11-21 10:39:16 UTC]]
---
  def create
    @holiday = Holiday.new(holiday_params)

    respond_to do |format|
      if @holiday.save

SELECT  "holidays".* FROM "holidays" WHERE "holidays"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_holiday
      @holiday = Holiday.find(params[:id])